app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "tip_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "wow so fresh, very help"], ["tip_id", 4], ["created_at", "2017-10-10 01:27:19.818088"], ["updated_at", "2017-10-10 01:27:19.818088"]]
---
  def create
    comment = Comment.new
    comment.content = params[:content]
    comment.tip_id = params[:tip_id]
    comment.save