app/controllers/tips_controller.rb

  def show
    @tip = Tip.find(params[:id])
---
SELECT  "tips".* FROM "tips" WHERE "tips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def index
    @tips = Tip.all
---
SELECT "tips".* FROM "tips"

  def edit
    @tip = Tip.find(params[:id])
---
SELECT  "tips".* FROM "tips" WHERE "tips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    tip = Tip.new
    tip.title = params[:title]
    tip.content = params[:content]
    tip.save
---
INSERT INTO "tips" ("title", "created_at", "updated_at", "content") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "test"], ["created_at", "2017-10-09 04:06:28.386714"], ["updated_at", "2017-10-09 04:06:28.386714"], ["content", "hello **world**\r\n"]]

  def update
    tip = Tip.find(params[:id])
    tip.title = params[:title]
    tip.content = params[:content]
    tip.save
---
SELECT  "tips".* FROM "tips" WHERE "tips"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "tips" SET "content" = $1, "updated_at" = $2 WHERE "tips"."id" = $3  [["content", "hello **world**\r\n# title 2\r\n"], ["updated_at", "2017-10-09 04:31:01.301025"], ["id", 4]]

  def destroy
    @tip = Tip.find(params[:id])
    @tip.destroy
---
SELECT  "tips".* FROM "tips" WHERE "tips"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "tips" WHERE "tips"."id" = $1  [["id", 5]]

  def delete
    @tip = Tip.find(params[:id])
---
SELECT  "tips".* FROM "tips" WHERE "tips"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]